In [1]:
import pandas as pd

appl = pd.read_csv('C:/Users/nswat/Documents/DataCamp/Datasets/4JoiningDataWPandasDatasets/appl.csv')
mcd = pd.read_csv('C:/Users/nswat/Documents/DataCamp/Datasets/4JoiningDataWPandasDatasets/mcd.csv')

appl

         date      close
0  2007-02-01  12.087143
1  2007-03-01  13.272857
2  2007-04-01  14.257143
3  2007-05-01  17.312857
4  2007-06-01  17.434286

In [2]:
mcd

         date      close
0  2007-01-01  44.349998
1  2007-02-01  43.689999
2  2007-03-01  45.049990
3  2007-04-01  48.279990
4  2007-05-01  50.549999